$(function () {

    'use strict';

    var CountSelect = $('.countries'),

        myCountries = ['اسوان', 'اسيوط', 'الاقصر', 'الاسكندرية', 'الاسماعيلية', 'البحرالاحمر', 'البحيرة', 'الجيزة', 'الدقهلية', 'السويس', 'الشرقية', 'الغربية', 'الفيوم', 'القاهرة', 'القليوبية', 'المنوفية', 'المنيا', 'الوادي_الجديد', 'بني_سويف', 'بورسعيد', 'جنوب_سيناء', 'دمياط', 'سوهاج', 'شمال_سيناء', 'قنا', 'كفرالشيخ', 'مطروح'],

        اسوان = ['ابو الريش', 'ابو سمبل', 'ادفو', 'البصيلية', 'الرديسية', 'السباعية', 'دراو', 'صحاري', 'كلابشة', 'كوم امبو', 'نصر النوبة'],

        اسيوط = ['أبنوب', 'أبو تيج', 'أسيوط الجديدة', 'البدارى', 'الغنايم', 'الفتح', 'القوصيه', 'ديروط', 'ساحل سليم', 'صدفا', 'مدينة اسيوط', 'منفلوط'],

        الجيزة = ['6 اكتوبر', 'ابو رواش', 'ارض اللواء', 'اوسيم', 'امبابة', 'البدرشين', 'البراجيل', 'الحرانية', 'الحوامدية', 'الدقي', 'الرماية', 'الشيخ زايد', 'الصحفيين', 'الصف', 'العجوزة', 'العزيزية', 'العمرانية', 'العياط', 'القرية الفرعونية', 'الكيت كات', 'المنصورية', 'المنيب', 'المهندسين', 'الهرم', 'الوراق', 'بشتيل', 'بنى سلامة', 'بولاق الدكرور', 'ترسا', 'جزيرة الدهب وكولدير', 'حدائق الاهرام', 'حي الجيزة', 'دهشور', 'ساقية مكي', 'سقارة', 'سوق الاحد', 'صفط', 'غرب سوميد', 'فيصل', 'كرداسة', 'كفر طهرمس', 'مركز الجيزة', 'مريوطية', 'ميت عقبة', 'ناهيا', 'وردان'],

        الاسكندرية = ['ابو قير', 'الازاريطة', 'الابراهيمية', 'الاسكندرية', 'الجمرك', 'الحضرة', 'الدخيلة', 'السيوف', 'الصالحية', 'الظاهرية', 'العامرية', 'العصافرة', 'العطارين', 'العوايد', 'القباري', 'اللبان', 'المعمورة', 'المكس', 'المنتزه', 'المندرة', 'المنشية', 'النخيل', 'النزهة', 'الورديان', 'باكوس', 'بحري والانفوشي', 'برج العرب', 'بولكلي', 'جليم', 'جناكليس', 'رأس التين', 'رشدي', 'زيزينيا', 'سابا باشا', 'سان ستيفانو', 'سبورتنج', 'ستانلي', 'سموحة', 'سيدي بشر', 'سيدي جابر', 'شاطبي', 'شدس', 'طوسون', 'عجمي', 'فلمنج', 'فيكتوريا', 'كامب شيزار', 'كرموز', 'كفر عبدو', 'كليوباترا', 'كوم الدكة', 'لوران', 'محرم بيك', 'محطة الرمل', 'ميامي', 'مينا البصل'],

        الاسماعيلية = ['ابو صوير', 'التل الكبير', 'القصاصين', 'القنطرة شرق', 'القنطرة غرب', 'فايد', 'مدينة الاسماعيلة '],

        البحرالاحمر = ['الغردقة', 'الجونة', 'القصير', 'رأس غارب', 'سفاجا', 'سهل حشيش', 'شلاتين', 'مرسى علم'],

        البحيرة = ['ابو المطامير', 'ابو حمص', 'ادكو', 'الدلنجات', 'الرحمانية', 'المحمودية', 'النوبارية الجديدة', 'ايتاي البارود', 'بدر', 'حوش عيسى', 'دمنهور', 'رشيد', 'شبراخيت', 'كفر الدوار', 'كوم حمادة', 'وادي النطرون'],
        
        الدقهلية = ['اجا', 'اخطاب', 'الجمالية', 'السنبلاوين', 'المطرية', 'المنزلة', 'المنصورة', 'بلقاس', 'بني عبيد', 'تمي الامديد', 'جمصة', 'دكرنس', 'شربين', 'طلخا', 'منية النصر', 'ميت سلسيل', 'ميت غمر', 'نبروه', ''],

        السويس = ['العين السخنة', 'حي الجناين', 'حي الاربعين', 'حي السويس', 'حي عتاقة', 'فيصل'],

        الغربية = ['السنطة', 'المحلة الكبرى', 'بسيون', 'زفتى', 'سمنود', 'طنطا', 'قطور', 'كفر الزيات'],

        الفيوم = ['اطسا', 'ابشواي', 'الفيوم الجديدة', 'سنورس', 'طامية', 'مدينة الفيوم', 'يوسف الصديق'],

        القاهرة = ['الاميرية', 'البساتين', 'التبين', 'التجمع الثالث', 'الجمالية', 'الحلمية', 'الحلمية الجديدة', 'الخليفة', 'الدراسة', 'الدرب الاحمر', 'الروضة', 'الزاوية الحمراء', 'الزمالك', 'الزيتون', 'الساحل', 'السيدة زينب', 'الشرابية', 'العاشر من رمضان', 'العاصمة الادارية الجديدة', 'العباسية', 'العبور', 'العتبة', 'القاهرة - اخرى', 'القاهرة الجديدة - التجمع الاول', 'القاهرة الجديدة - اخرى', 'القاهرة الجديدة - الاندلس', 'القاهرة الجديدة - التجمع الخامس', 'القاهرة الجديدة - لوتس', 'القاهرة الجديدة - مدينة الرحاب', 'القطامية', 'الماظة', 'المرج', 'المطرية', 'المعادي', 'المعصرة', 'المقطم', 'المنيرة', 'المنيرة الجديدة', 'المنيل', 'الموسكي', 'النزهة', 'الوايلى', 'باب الشعرية', 'بولاق', 'بيت الوطن', 'جاردن سيتي', 'حدائق القبة', 'حدائق حلوان', 'حلوان', 'دار السلام', 'رمسيس وامتداد رمسيس', 'روض الفرج', 'زهراء المعادي', 'شبرا', 'شيراتون', 'طرة', 'عزبة النخل', 'عين شمس', 'قصر النيل', 'مدينة 15 مايو', 'مدينة السلام', 'مدينة الشروق', 'مدينة المستقبل', 'مدينة بدر', 'مدينة نصر', 'مدينتي', 'مسطرد', 'مصر الجديدة', 'مصر القديمة', 'هليوبليس الجديدة', 'وسط القاهرة'],

        القليوبية = ['الخانكة', 'الخصوص', 'العبور', 'القناطر الخيرية', 'بنها', 'بهتيم', 'زاوية النجار', 'شبرا الخيمة', 'شبين القناطر', 'طوخ', 'قليوب', 'قها', 'كفر شكر'],

        المنوفية = ['اشمون', 'الباجور', 'السادات', 'الشهداء', 'بركة السبع', 'تلا', 'سرس الليان', 'شبين الكوم', 'قويسنا', 'منوف', 'ميت العز'],

        المنيا = ['ابو قرقاص', 'العدوة', 'المنيا الجديدة', 'بني مزار', 'دير مواس', 'سمالوط', 'مدينة المنيا', 'مطاي', 'مغاغة', 'ملوي'],

        بني_سويف = ['اهناسيا', 'الفشن', 'الواسطى', 'ببا', 'بني سويف الجديدة', 'سمسطا', 'مديمة بنى سويف', 'ناصر'],

        بورسعيد = ['حي الجنوب', 'حي الزهور', 'حي الشرق', 'حي الضواحي', 'حي العرب', 'حي المناخ', 'مدينة بورفؤاد'],

        جنوب_سيناء = ['ابو رديس', 'ابو زنيمة', 'دهب', 'رأس سدر', 'سانت كاترين', 'شرم الشيخ', 'طابا', 'طور سيناء', 'نويبع'],

        دمياط = ['الروضة', 'الزرقا', 'السرو', 'دمياط الجديدة', 'رأس البر', 'عزبة البرج', 'فارسكور', 'كفر البطيخ', 'كفر سعد', 'مدينة دمياط', 'ميت ابو غالب'],

        سوهاج = ['اخميم', 'البلينا', 'المعسرات', 'المراغة', 'المنشأة', 'جرجا', 'جهينة', 'دار السلام', 'ساقلتة', 'طما', 'طهطا', 'مدينة سوهاج'],

        شمال_سيناء = ['الحسنة', 'الشيخ زويد', 'العريش', 'بئر العبد', 'رفح', 'نخل'],

        قنا = ['ابو تشت', 'الوقف', 'شنا', 'فرشوط', 'قفط', 'قوص', 'مدينة قنا', 'نجع حمادي', 'نقادة'],

        كفرالشيخ = ['البرلس', 'الحامول', 'الرياض', 'بلطيم', 'بيلا', 'دسوق', 'سيدي سالم', 'فوه', 'قلين', 'مدينة كفر الشيخ', 'مطوبس'],

        مطروح = ['الحمام', 'الساحل الشمالي', 'السلوم', 'الضبعة', 'العلمين', 'النجيلة', 'براني', 'سيوة', 'مارينا العلمين', 'مرسى مطروح'],

        الوادي_الجديد = ['الخارجة', 'الداخلة', 'الفرافرة', 'باريس', 'بلاط', 'مدينة موط'],

        الشرقية = ['ابو حماد', 'ابو كبير', 'الابراهيمية', 'الحسينية', 'الزقازيق', 'الصالحية الجديدة', 'العاشر من رمضان', 'القرين', 'الفنايات', 'بلبيس', 'ديرب نجم', 'فاقوس', 'كفر صقر', 'مشتول السوق', 'منيا القمح', 'ههيا'],

        الاقصر = ['ارمنت', 'اسنا', 'البياضية', 'الزينية', 'الطود', 'القرنه', 'مدينة الاقصر'];


    // Function Create Option    

    function CreateOption(valriable, elementToAppend) {

        var i;

        for (i = 0; i < valriable.length; i += 1) {

            $('<option>', { value: valriable[i], text: valriable[i], id: valriable[i] })
                .appendTo(elementToAppend);
        }
    }


    CreateOption(myCountries, $('.countries'));

    CreateOption(اسيوط, $('.اسيوط'));
    CreateOption(الاسماعيلية, $('.الاسماعيلية'));
    CreateOption(الجيزة, $('.الجيزة'));
    CreateOption(الاسكندرية, $('.الاسكندرية'));
    CreateOption(اسوان, $('.اسوان'));
    CreateOption(الاقصر, $('.الاقصر'));
    CreateOption(البحرالاحمر, $('.البحرالاحمر'));
    CreateOption(البحيرة, $('.البحيرة'));
    CreateOption(الدقهلية, $('.الدقهلية'));
    CreateOption(السويس, $('.السويس'));
    CreateOption(الشرقية, $('.الشرقية'));
    CreateOption(الغربية, $('.الغربية'));
    CreateOption(الفيوم, $('.الفيوم'));
    CreateOption(القاهرة, $('.القاهرة'));
    CreateOption(القليوبية, $('.القليوبية'));
    CreateOption(المنوفية, $('.المنوفية'));
    CreateOption(المنيا, $('.المنيا'));
    CreateOption(الوادي_الجديد, $('.الوادي_الجديد'));
    CreateOption(بني_سويف, $('.بني_سويف'));
    CreateOption(بورسعيد, $('.بورسعيد'));
    CreateOption(جنوب_سيناء, $('.جنوب_سيناء'));
    CreateOption(دمياط, $('.دمياط'));
    CreateOption(سوهاج, $('.سوهاج'));
    CreateOption(شمال_سيناء, $('.شمال_سيناء'));
    CreateOption(قنا, $('.قنا'));   
    CreateOption(كفرالشيخ, $('.كفرالشيخ'));
    CreateOption(مطروح, $('.مطروح'));



    // Hide All Select
    $('.option select').hide();
    $('.option select').prop("selected", false)

    // $('.option select').attr("required", "false");


    // Show First Selected
    $('.غيرمحدد').show().css('display', 'inline-block');



    // Show List Option City Whene user Chosse Countries

    CountSelect.on('change', function () {

        // get Id option 
        var myId = $(this).find(':selected').attr('id');
        console.log('.' + myId);
        $('.option select').prop("selected", false)

        // Show Select Has class = Id And Hide Siblings
        $('.option select').filter('.' + myId).fadeIn(400).siblings('select').hide();
        $('.option select').removeAttr("name");
        $('.option select').removeAttr("required");
        $('.option:selected').remove();
        $('.' + myId).attr("name", "city");
        $('.' + myId).attr("required",'true');





    });

});